docs/README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Remote Desktop Support with P2P VNC</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="02 February 2014"/>
<meta name="author" content="Dashamir Hoxha"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link href="css/org.css" rel="stylesheet" type="text/css"/>
</head>
<body>
<div id="content">

<h1 class="title">Remote Desktop Support with P2P VNC</h1>


<p>
VNC is a well-known tool for remote desktop view and control. The
two computers establish a TCP connection so that one of them can
access the display of the other. However, almost always these two
computers are behind a firewall/router and do not have a real IP to
be accessed from the Internet. In such a case one of them can do
<b>port forwarding</b> on the router/firewall and this would allow the
connection to be established.
</p>
<p>
The problem is that more often than not, none of the parts that want
to establish such a remote connection have access to the firewall
that separates/protects it from the real Internet. Sometimes it can
even be several levels deep behind the firewall (several layers of
firewalls). However, if you have access to an external server (for
example a server in the cloud) there is still a workaround and
things can be fixed to work. For more details read the docs, which
explain the tricks and hacks that can be used in such a case in
order to establish a secure connection to a remote desktop.
</p>
<p>
This project has some scripts that simplify the installation of a
P2P server, and the connection between the two clients.
</p>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Basic Installation and Usage </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Installation of a P2P server </h3>
<div class="outline-text-3" id="text-1.1">


<p>
For more security and flexibility, the installation is done inside a
chroot environment (which is built with debootstrap):
</p>



<pre class="example">cd /var/chroot/
git clone https://github.com/dashohoxha/p2p.git
nohup nice p2p/server/install.sh P2P &amp;
tail -f nohup.out
</pre>




<p>
After the installation is done, you can start and stop the service
with:
</p>


<pre class="example">service chroot-P2P stop
service chroot-P2P start
</pre>





</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Sharing the desktop (on the client) </h3>
<div class="outline-text-3" id="text-1.2">


<p>
To share the desktop we need a VNC server. Make sure that <b>x11vnc</b>
is installed:
</p>


<pre class="example">sudo apt-get install x11vnc
</pre>




<p>
Then get the scripts from GitHub:
</p>


<pre class="example">git clone https://github.com/dashohoxha/p2p.git p2p-vnc
chmod 600 p2p-vnc/client/keys/*.key
</pre>




<p>
Set the the port and the IP (or DN) of the P2P server at
<code>p2p-vnc/client/ssh.rc</code>:
</p>


<pre class="example">### the IP or DN of the p2p server
p2p_server=127.0.0.1

### the port of the sshd service in the p2p server
p2p_port=2201
</pre>




<p>
Now share the VNC port and start an <b>x11vnc</b> server.
</p>


<pre class="example">p2p-vnc/client/start_x11vnc.sh 

KEY: b8e1f1e779

Give it to the remote part in order to access your desktop.
To stop the connection run: p2p-vnc/client/stop.sh b8e1f1e779
</pre>




<p>
The script will return a randomly generated key which you should
give to the other part which needs to access your desktop.
</p>
<p>
There are more options to try. Change them at the config file
<b>vnc.rc</b> or from the command line:
</p>


<pre class="example">p2p-vnc/client/start_x11vnc.sh --help

Usage: p2p-vnc/client/start_x11vnc.sh [OPTIONS]

Share the VNC port and start an x11vnc server.
The options from command line override the settings
on the config file 'vnc.rc'.

    --help             display this help screen
    --vnc_port=&lt;port&gt;  set the VNC port (5900)
    --window=yes       share a single window, not the whole desktop
    --viewonly=yes     the desktop cannot be controlled remotely
    --shared=yes       more than one computer can connect at the same time
    --forever=yes      keep listening for more connections (don't exit
                       when the first client(s) disconnect)
</pre>





</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Accessing the remote desktop (from the other client) </h3>
<div class="outline-text-3" id="text-1.3">


<p>
To access a remote desktop we need a VNC client. Make sure that
<b>vncviewer</b> is installed:
</p>


<pre class="example">sudo apt-get install vncviewer
</pre>




<p>
Then get the Spitz from GitHub:
</p>


<pre class="example">git clone https://github.com/dashohoxha/p2p.git p2p-vnc
chmod 600 p2p-vnc/client/keys/*.key
</pre>




<p>
Set the the port and the IP (or DN) of the P2P server at
<code>p2p-vnc/client/ssh.rc</code>:
</p>


<pre class="example">### the IP or DN of the p2p server
p2p_server=127.0.0.1

### the port of the sshd service in the p2p server
p2p_port=2201
</pre>




<p>
Now connect to the remote VNC port and start <b>vncviewer</b>.
</p>


<pre class="example">p2p-vnc/client/start_vncviewer.sh --key=b8e1f1e779
</pre>




<p>
You will need to know the number of the key that was created by the
remote desktop.
</p>
<p>
See also the usage:
</p>


<pre class="example">p2p-vnc/client/start_vncviewer.sh --help

Usage: p2p-vnc/client/start_vncviewer.sh [OPTIONS]

Connect to the remote VNC port and start vncviewer.
The options from command line override the settings
on the config file 'vnc.rc'.

    --help             display this help screen
    --vnc_port=&lt;port&gt;  set the VNC port (5900)
    --key=&lt;key&gt;        key for connecting to the remote desktop
</pre>





</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Closing a connection </h3>
<div class="outline-text-3" id="text-1.4">


<p>
From any (or both) of the clients, the connection can be closed
with:
</p>


<pre class="example">p2p-vnc/client/stop.sh b8e1f1e779
</pre>



<p>
This will cleanup the keys on the server, close the ssh tunnels,
and close the programs that were started locally (x11vnc,
vncviewer, etc.)
</p>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Other Use Cases </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Sharing a single widow </h3>
<div class="outline-text-3" id="text-2.1">


<p>
Use the option <code>--window=yes</code> from command line (or set it on
<code>vnc.rc</code>) to share only a single window (not the whole
desktop). When this option is 'yes', the mouse will become like a +
(cross-hair) and you will be able to select a window.
</p>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> Make a demonstration to one or more people </h3>
<div class="outline-text-3" id="text-2.2">


<p>
Start <b>x11vnc</b> with options like these:
</p>


<pre class="example">p2p-vnc/client/start_x11vnc.sh --viewonly=yes --shared=yes
</pre>




<p>
The remote viewers will not be able to control your desktop (or
window) and more than one viewers will be able to connect.
</p>
</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> Share the desktop permanently </h3>
<div class="outline-text-3" id="text-2.3">


<p>
Suppose that time after time you need to access the computer at
home remotely. Usually, after <b>vncviewer</b> is closed, <b>x11vnc</b> is
closed automatically. But if the option <code>--forever=yes</code> is
used, x11vnc will keep listening for more connections (after the
first client(s) disconnect).
</p>


<pre class="example">p2p-vnc/client/start_x11vnc.sh --forever=yes
</pre>




<p>
<b>Note:</b> Keep in mind that a cron job on the P2P server will
automatically delete keys older than one day. Without the key, you
will not be able to access the desktop even if <i>x11vnc</i> is still
listening. If this is not what you want, try to fix this on the P2P
server (either stop the cron or make the period longer).
</p>
</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> Share the Linux console (tty) </h3>
<div class="outline-text-3" id="text-2.4">


<p>
This is very similar to sharing the desktop, but it can share the
Linux consoles (from tty2 to tty6):
</p>


<pre class="example">p2p-vnc/client/start_linuxvnc.sh --tty=3
</pre>




</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5"><span class="section-number-3">2.5</span> Share your local webserver </h3>
<div class="outline-text-3" id="text-2.5">


<p>
Usually web developers use a local webserver for building an
application.  What would you do to show the current prototype to
the customer or to another developer? You can share your desktop,
or you can share only the window of the browser. But you can also
share your local webserver (port 80 and 443).
</p>
<p>
It can be done like this:
</p>
<ul>
<li>
On you side you run:



<pre class="example">sudo p2p-vnc/client/port_share.sh 80
3e41a200bd
sudo p2p-vnc/client/port_share.sh 443
c9277c986d
</pre>



<p>
You need <b>sudo</b> in this case because <b>80</b> and <b>443</b> are
privileged ports and can be forwarded only by root.
</p>
</li>
<li>
On the other side, your partner should run:



<pre class="example">sudo p2p-vnc/client/port_connect.sh 80 3e41a200bd
sudo p2p-vnc/client/port_connect.sh 443 c9277c986d
</pre>



<p>
The connection keys are provided to him by you. He should make
sure that he does not have any local webserver running on ports
80 and 443. Now he can open <code>localhost</code> or <code>127.0.0.1</code> on his
browser and he will directly access your local webserver.
</p>
</li>
<li>
To stop sharing, both of you can run:



<pre class="example">sudo p2p-vnc/client/port_stop.sh 3e41a200bd
sudo p2p-vnc/client/port_stop.sh c9277c986d
</pre>




</li>
</ul>

<p>The same way can be used for sharing other ports/services as well.
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Dashamir Hoxha
<a href="mailto:dashohoxha@gmail.com">&lt;dashohoxha@gmail.com&gt;</a>
</p>
<p class="date"> Date: 02 February 2014</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
